Repository: pypi-data/pypi-mirror-383
Catalog: packages/Products.urban/Products.urban-2.5.0.dev21.tar.gz/Products.urban-2.5.0.dev21/src/Products/urban/locales/*/LC_MESSAGES/datagridfield.po
Languages: fr

source: Detail
fr: Détail

source: End date
fr: Date de fin de l'enquête

source: Feature
fr: Description de la particularité diverse

source: FieldName
fr: Champ

source: Number
fr: Numéro

source: ParcelLabel
fr: N° parcelle (plan)

source: ParcelReference
fr: Référence cadastrale

source: Road equipment details
fr: Détails concernant les équipements

source: Road equipments
fr: Equipements de la voirie au droit du bien

source: ServitudeConstraints
fr: Contraintes induites

source: ServitudeDescription
fr: Nature des servitudes et autres droits

source: Start date
fr: Date du début de l'enquête

source: Street
fr: Rue

source: Text
fr: Texte
