Repository: pypi-data/pypi-mirror-383
Catalog: packages/redturtle.bandi/redturtle_bandi-1.6.1.tar.gz/redturtle_bandi-1.6.1/redturtle/bandi/locales/*/LC_MESSAGES/redturtle.bandi.po
Languages: it

source: Add Bandi Portlet
it: Aggiungi Portlet Bandi

source: Alternative text to show in 'other' link.
it: Testo alternativo da mostrare nel link ad 'altro'

source: Bandi Settings
it: Bandi

source: Closed
it: Chiuso

source: Edit Bandi Portlet
it: Modifica Portlet Bandi

source: In progress
it: In corso

source: Insert an internal link. This field override external link field
it: Inserisci un link interno. Questo campo sovrascriverà il campo link esterno.

source: Internal link
it: Link interno.

source: Open
it: Attivo

source: Other text
it: Testo per 'altro'

source: Scheduled
it: Programmato

source: This portlet display a listing of bandi from a Collection.
it: Questa portlet mostra una lista di bandi da una collezione.

source: apertura_bando_help
it: Data e ora dell'apertura del bando. Usa questo campo se vuoi impostare una data di apertura specifica. Se non impostato, il bando sarà aperto immediatamente.

source: apertura_bando_label
it: Data di apertura

source: bandi_published_on
it: Pubblicato il

source: bandi_search_authority_label
it: Enti

source: bandi_search_help
it: Questa maschera di ricerca permette di trovare i bandi nel sito che soddisfano uno o più criteri di ricerca.

source: bandi_search_label
it: Ricerca bandi

source: bandi_search_recipients_help
it: Seleziona i destinatari dei bandi.

source: bandi_search_recipients_label
it: Destinatari

source: bandi_search_state_all
it: Tutti

source: bandi_search_state_closed
it: Chiusi

source: bandi_search_state_inprogress
it: In corso

source: bandi_search_state_label
it: Stato

source: bandi_search_state_open
it: Aperti

source: bandi_search_state_scheduled
it: Programmati

source: bandi_search_text_help
it: Per una semplice ricerca di testo inserisci qui i termini desiderati. Possono essere cercate più parole contemporaneamente combinandole con gli operatori <strong>AND</strong> e <strong>OR</strong>. Il testo inserito in questo campo verrà cercato nel titolo, descrizione e testo dei bandi.

source: bandi_search_text_label
it: Ricerca testuale

source: bandi_search_type_help
it: Seleziona una tipologia di bando.

source: bandi_search_type_label
it: Tipologia

source: bandi_searchsites_help
it: Seleziona i portali dove effettuare la ricerca.

source: bandi_searchsites_label
it: Portali disponibili

source: bandi_settings_label
it: Impostazioni per i bandi

source: bandi_use_solr_help
it: Se selezionato, la ricerca verrà effettuata in una serie di portali ER. Se non selezionato, la ricerca verrà effettuata solamente in questo portale.

source: bandi_use_solr_label
it: Ricerca multisito

source: bando_chiusura_procedimento
it: Chiusura procedimento

source: bando_pub_date
it: Data di pubblicazione

source: bando_scadenza_partecipazione
it: Scadenza termini partecipazione

source: bando_status_label
it: Stato

source: batch_x_item_matching_your_criteria
it: ${number} elemento soddisfa i criteri specificati

source: batch_x_items_matching_your_criteria
it: ${number} elementi soddisfano i criteri specificati

source: chiusura_procedimento_bando_label
it: Data chiusura procedimento

source: closed
it: Chiuso

source: default_destinatari_help
it: Inserisci una lista di possibili destinatari che possono essere selezionati quando si aggiunge o modifica un Bando.

source: default_destinatari_label
it: Destinatari

source: default_ente_help
it: Inserisci una lista di enti di default che verranno automaticamente selezionati quando si aggiunge un nuovo Bando.

source: default_ente_label
it: Enti di default

source: description_no_items_in_folder
it: Non ci sono elementi.

source: description_no_results_found
it: Nessun risultato è stato trovato

source: destinatari_label
it: Destinatari

source: ente_help
it: Selezionare l'ente proponente del bando.

source: ente_label
it: Ente

source: heading_search_results
it: Risultati ricerca bandi

source: help_search_authorities
it: Mostra i bandi appartenenti a questi enti. Possono essere selezionati più tag mantenendo premuto il tasto Ctrl (o il tasto Mela sul Mac).

source: in-progress
it: In corso

source: label_search
it: Cerca

source: more_url
it: Altro…

source: open
it: Attivo

source: riferimenti_bando_help
it: indicare la struttura di riferimento e il responsabile del procedimento

source: riferimenti_bando_label
it: Riferimenti

source: scadenza_bando_help
it: Scadenza dei termini per partecipare al bando

source: scadenza_bando_label
it: Data e ora di scadenza

source: scheduled
it: Programmato

source: tiles_collection_noresults
it: Non sono stati trovati bandi

source: tipologia_bando_label
it: Tipologia di bando

source: tipologie_bando_label
it: Tipi di Bando

source: tipologie_help
it: Questi valori estendono quelli del file bandi.xml su filesystem

source: title_rss_feed
it: Ricevi il flusso RSS costantemente aggiornato dei risultati di questa ricerca
