Repository: pypi-data/pypi-mirror-383
Catalog: packages/aa-blueprints/aa_blueprints-1.8.0-py3-none-any.whl/blueprints/locale/*/LC_MESSAGES/django.po
Languages: fr, ja, ru

source: Blueprint Library
fr: Bibliothèque de Blueprint
ja: ブループリントライブラリ
ru: Библиотека схем элементов

source: Manufacturing
fr: Fabrication
ja: 製造業
ru: Производство

source: Researching Technology
fr: Recherche technologique
ja: 技術の研究中
ru: Исследовательские технологии

source: Researching Time Efficiency
fr: Recherche de l'efficacité du temps
ja: 時間効率の調査
ru: Исследование эффективности времени

source: Researching Material Efficiency
fr: Recherche d'efficacité matérielle
ja: 材料効率の調査
ru: Исследование эффективности материалов

source: Copying
fr: Copie
ja: コピー中
ru: Копирование

source: Duplicating
fr: Duplication
ja: 複製中
ru: Дублирование

source: Reverse Engineering
fr: Ingénierie inverse
ja: リバースエンジニアリング
ru: Обратное проектирование

source: Inventing
fr: Inventer
ja: 発明する
ru: Изобретение

source: Reacting
fr: Réagir
ja: 反応する
ru: Реагируя

source: Library
fr: Bibliothèque
ja: 図書館
ru: Библиотека

source: My Requests
fr: Mes demandes
ja: マイリクエスト
ru: Мои запросы

source: Open Requests
fr: Demandes ouvertes
ja: オープンリクエスト
ru: Открытые запросы

source: Manage Blueprints
fr: Gérer les Blueprints
ja: ブループリントの管理
ru: Управление схемами элементов

source: Type
ja: タイプ
ru: Тип

source: Quantity
fr: Quantité
ja: 数量
ru: Количество

source: Qty
fr: Qté
ja: 数量
ru: Кол-во

source: Owner
fr: Propriétaire
ja: 所有者
ru: Владелец

source: Material Efficiency
fr: Efficacité des
ja: 材料効率
ru: Эффективность материалов

source: ME
fr: MOI
ja: 私に
ru: МЕНЯ

source: Time Efficiency
fr: Efficacité temps
ja: 時間効率
ru: Эффективность времени

source: TE
ja: てー

source: Original
fr: Originale
ja: オリジナル
ru: Оригинал

source: Runs Remaining
fr: Exécutions restantes
ja: 残りのラン
ru: Остающиеся пробеги

source: Blueprints in use are highlighted in blue.
fr: Les plans utilisés sont mis en surbrillance en bleu.
ja: 使用中のブループリントは青色で強調表示されます。
ru: Используемые схемы элементов выделены синим цветом.

source: Runs
fr: Fonctionne
ja: 実行する
ru: Прогоняет

source: Requested From
fr: Demandé de
ja: リクエスト元
ru: Запрошено от

source: Requestor
fr: Demandeur
ja: リクエスタ
ru: Запрашивающая сторона

source: Add My Blueprints
fr: Ajouter Mes Blueprints
ja: マイブループリントの追加
ru: Добавить мои схемы элементов

source: Add Corporation Blueprints
fr: Ajouter des plans de construction de société
ja: コーポレーションブループリントの追加
ru: Добавление схем элементов корпорации

source: Name
fr: Nom
ja: 名前
ru: Имя

source: Location
fr: Emplacement
ja: 所在地
ru: Местоположение

source: Is BPO?
fr: C'est BPO ?
ja: BPOですか？
ru: Является ли BPO?

source: View Blueprint
fr: Voir le Plan
ja: ブループリントを見る
ru: Просмотр схемы элементов

source: Mark Request as Cancelled
fr: Marquer la demande comme annulée
ja: リクエストをキャンセル済みとしてマークする
ru: Пометить запрос как отмененный

source: Mark Request as Fulfilled
fr: Marquer la demande comme exécutée
ja: リクエストを履行済みとしてマークする
ru: Пометить запрос как выполненный

source: Mark Request as In Progress
fr: Marquer la demande comme en cours
ja: リクエストを進行中としてマークする
ru: Пометить запрос как выполнялся

source: Mark Request as Open
fr: Marquer la demande comme ouverte
ja: リクエストをオープンとしてマークする
ru: Пометить запрос как открытый

source: Create Request
fr: Créer une demande
ja: リクエストの作成
ru: Создать запрос

source: Request Information
fr: Demande d'information
ja: 情報をリクエストする
ru: Запросить информацию

source: Remove Blueprints
fr: Supprimer les Blueprints
ja: ブループリントの削除
ru: Удаление схем элементов

source: Loading...
fr: Chargement...
ja: ロード中...
ru: Загрузка...

source: Summary
fr: Résumé
ja: 要約
ru: Резюме

source: Current Job
fr: Travail actuel
ja: 現在のジョブ
ru: Текущее задание

source: Blueprint Location
fr: Emplacement du plan
ja: ブループリントの場所
ru: Расположение схемы элементов

source: Activity
fr: Activité
ja: アクティビティ
ru: Деятельность

source: Installer
fr: Installateur
ja: インストーラ
ru: Установщик

source: Start Date
fr: Date de début
ja: 開始日
ru: Дата начала

source: End Date
fr: Date de fin
ja: 終了日
ru: Дата окончания

source: View Request
fr: Voir la demande
ja: リクエストを表示
ru: Просмотр запроса

source: Blueprint Type
fr: Type de plan
ja: ブループリントタイプ
ru: Тип схемы элементов

source: %(value)s is not a valid material efficiency
fr: %(value)s n'est pas une efficacité matérielle valide
ja: %(value)sは有効な材料効率ではありません
ru: %(value)s не является допустимой эффективностью материала

source: %(value)s is not a valid time efficiency
fr: %(value)s n'est pas une efficacité temporelle valide
ja: %(value)sは有効な時間効率ではありません
ru: %(value)s не является допустимой эффективностью времени

source: You can only use your main or alt characters to add corporations. However, character %s is neither.
fr: Vous ne pouvez utiliser vos caractères principaux ou alt que pour ajouter des sociétés. Cependant, le caractère %s n'est ni l'un ni l'autre.
ja: 法人を追加するには、メイン文字または代替文字のみを使用できます。ただし、文字 %s はどちらもありません。
ru: Вы можете использовать только основные или alt символы для добавления корпораций. Однако символ %s не является ни другим.

source: %(corporation)s was added as new corporate blueprint owner by %(user)s.
fr: %(corporation)s a été ajouté en tant que nouveau propriétaire de plan d'entreprise par %(user)s.
ja: %(corporation)s は、%(user)s によって、新しいコーポレートブループリントオーナーとして追加された。
ru: %(corporation)s был добавлен в качестве нового владельца корпоративной схемы элементов %(user)s.

source: %(character)s has been added. We have started fetching blueprints for this character. You will receive a report once the process is finished.
fr: %(character)s a été ajouté. Nous avons commencé à chercher des plans pour ce personnage. Vous recevrez un rapport une fois le processus terminé.
ja: %(character)sを追加しました。このキャラクターの設計図の取得を開始しました。プロセスが完了すると、レポートが届きます。
ru: добавлен %(character)s. Мы начали извлекать чертежи для этого персонажа. Вы получите отчет, как только процесс будет завершен.

source: %(character)s was added as a new personal blueprint owner.
fr: %(character)s a été ajouté en tant que nouveau propriétaire de plan personnel.
ja: %(character)s が新しいパーソナルブループリント所有者として追加されました。
ru: %(character)s был добавлен в качестве нового владельца личной схемы элементов.

source: Yes
fr: Oui
ja: はい
ru: Да

source: No
fr: Non
ja: いいえな
ru: Нет

source: Corporate
ja: コーポレート
ru: Корпоративный

source: Personal
fr: Personnel
ja: 個人用
ru: Персональный

source: A copy of %(blueprint)s has been requested.
fr: Une copie de %(blueprint)s a été demandée.
ja: %(blueprint)s のコピーが要求されました。
ru: Запрошена копия %(blueprint)s.

source: The request for %(blueprint)s has been closed as fulfilled.
fr: La demande de %(blueprint)s a été clôturée comme satisfaite.
ja: %(blueprint)s の要求は完了済みとして閉じられました。
ru: Запрос на %(blueprint)s был закрыт по мере выполнения.

source: Fulfilling the request for %(blueprint)s has failed.
fr: L'exécution de la demande pour %(blueprint)s a échoué.
ja: %(blueprint)s の要求を実行できませんでした。
ru: Не удалось выполнить запрос для %(blueprint)s.

source: The request for %(blueprint)s has been marked as in progress.
fr: La demande de %(blueprint)s a été marquée comme étant en cours.
ja: %(blueprint)s の要求は、進行中としてマークされています。
ru: Запрос на %(blueprint)s помечен как выполнялся.

source: Marking the request for %(blueprint)s as in progress has failed.
fr: Le marquage de la demande pour %(blueprint)s comme étant en cours a échoué.
ja: %(blueprint)s の要求を処理中としてマークできませんでした。
ru: Не удалось пометить запрос на %(blueprint)s как выполнявшийся.

source: The request for %(blueprint)s has been re-opened.
fr: La demande de %(blueprint)s a été rouverte.
ja: %(blueprint)s のリクエストが再開されました。
ru: Запрос на %(blueprint)s был вновь открыт.

source: Re-opening the request for %(blueprint)s has failed.
fr: La réouverture de la demande pour %(blueprint)s a échoué.
ja: %(blueprint)s の要求を再オープンできませんでした。
ru: Не удалось повторно открыть запрос для %(blueprint)s.

source: The request for %(blueprint)s has been closed as cancelled.
fr: La demande de %(blueprint)s a été clôturée comme annulée.
ja: %(blueprint)s の要求はキャンセルされたとして閉じられました。
ru: Запрос на %(blueprint)s был закрыт как отмененный.

source: Cancelling the request for %(blueprint)s has failed.
fr: L'annulation de la demande pour %(blueprint)s a échoué.
ja: %(blueprint)s の要求のキャンセルに失敗しました。
ru: Не удалось отменить запрос для %(blueprint)s.

source: %(owner)s has been removed as a blueprint owner.
fr: %(owner)s a été supprimé en tant que propriétaire du Blueprint.
ja: %(owner)s は、設計図の所有者として削除されました。
ru: %(owner)s был удален как владелец схемы элементов.

source: Removing the blueprint owner has failed.
fr: La suppression du propriétaire du Blueprint a échoué.
ja: ブループリント所有者の削除に失敗しました。
ru: Не удалось удалить владельца схемы элементов.

source: %(corporation)s has been added with %(character)s as sync character. We have started fetching blueprints for this corporation. You will receive a report once the process is finished.
fr: %(corporation)s a été ajouté avec %(character)s comme caractère de synchronisation. Nous avons commencé à chercher des plans pour cette société. Vous recevrez un rapport une fois le processus terminé.
ru: %(corporation)s был добавлен с %(character)s в качестве символа синхронизации. Мы начали извлекать чертежи для этой корпорации. Вы получите отчет, как только процесс будет завершен.
