Repository: pypi-data/pypi-mirror-383
Catalog: packages/aa-memberaudit/aa_memberaudit-4.1.0.tar.gz/aa_memberaudit-4.1.0/memberaudit/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Member Audit
uk: Аудит посіпаки

source: excellent standing
uk: відмінний статус

source: good standing
uk: гарний статус

source: neutral standing
uk: нейтральний статус

source: bad standing
uk: поганий статус

source: terrible standing
uk: жахливий статус

source: alliance
uk: альянс

source: corporation
uk: корпорація

source: private
uk: приватний

source: public
uk: публічний

source: canceled
uk: скасовано

source: deleted
uk: видалено

source: failed
uk: не вдалося

source: finished
uk: завершено

source: finished contractor
uk: завершено (виконавець)

source: finished issuer
uk: завершено (замовник)

source: in progress
uk: у процесі

source: outstanding
uk: очікує

source: rejected
uk: відхилено

source: reversed
uk: скасовано

source: auction
uk: аукціон

source: courier
uk: кур'єр

source: item exchange
uk: обмін предметами

source: loan
uk: позика

source: unknown
uk: невідомо

source: [Multiple Items]
uk: [Декілька предметів]

source: male
uk: чоловік

source: female
uk: жінка

source: Paladin Crusader
uk: Паладін-Хрестоносець

source: Templar Lieutenant
uk: Лейтенант Тамплієр

source: Cardinal Lieutenant
uk: Лейтенант Кардинал

source: Arch Lieutenant
uk: Лейтенант-Архієпископ

source: Imperial Major
uk: Майор Імперії

source: Marshal Commander
uk: Командир-Маршал

source: Imperator Commander
uk: Командир-Імператор

source: Tribunus Colonel
uk: Трибун-полковник

source: Legatus Commodore
uk: Легат-комодор

source: Divine Commodore
uk: Божественний комодор

source: Protectorate Ensign
uk: Енсин Протекторату

source: Second Lieutenant
uk: Сублейтенант

source: First Lieutenant
uk: Лейтенант

source: Captain
uk: Капітан

source: Major
uk: Майор

source: Lieutenant Colonel
uk: Підполковник

source: Colonel
uk: Полковник

source: Wing Commander
uk: Командир відділення

source: Strike Commander
uk: Командир удару

source: Brigadier General
uk: Бригадний генерал

source: Federation Minuteman
uk: Мінутмен Федерації

source: Defender Lieutenant
uk: Лейтенант Захисника

source: Guardian Lieutenant
uk: Лейтенант Стража

source: Lieutenant Sentinel
uk: Лейтенант Сентинел

source: Shield Commander
uk: Командир Щита

source: Aegis Commander
uk: Командир Егіда

source: Vice Commander
uk: Віце-командир

source: Major General
uk: Генерал-майор

source: Lieutenant General
uk: Генерал-лейтенант

source: Luminaire General
uk: Генерал Люменера

source: Nation Warrior
uk: Воїн Нації

source: Spike Lieutenant
uk: Лейтенант Спайк

source: Spear Lieutenant
uk: Лейтенант Спір

source: Venge Captain
uk: Капітан Венж

source: Lance Commander
uk: Командир Ланцюга

source: Blade Commander
uk: Командир Клинка

source: Talon Commander
uk: Командир Талону

source: Voshud Major
uk: Майор Вошуд

source: Matar Colonel
uk: Полковник Матар

source: Valklear General
uk: Генерал Вальклір

source: undefined
uk: невизначено

source: station ID
uk: ID станції

source: market transaction ID
uk: ID операції на ринку

source: character ID
uk: ID персонажа

source: corporation ID
uk: ID корпорації

source: alliance ID
uk: ID альянсу

source: eve system
uk: система EVE

source: industry job ID
uk: ID завдання в галузі

source: contract ID
uk: ID контракту

source: planet ID
uk: ID планети

source: system ID
uk: ID системи

source: type ID
uk: ID типу

source: assets
uk: майно

source: attributes
uk: атрибути

source: contacts
uk: контакти

source: contracts
uk: контракти

source: corporation history
uk: історія корпорацій

source: faction warfare statistics
uk: статистика фракційних війн

source: implants
uk: імпланти

source: jump clones
uk: клони

source: location
uk: розташування

source: loyalty
uk: лояльність (lp)

source: mails
uk: пошта

source: mining ledger
uk: журнал копача

source: online status
uk: статус онлайну

source: planets
uk: планети

source: ship
uk: корабель

source: skills
uk: навички

source: skill queue
uk: черга навичок

source: skill sets
uk: категорії навичок

source: wallet balance
uk: баланс рахунку

source: wallet journal
uk: журнал транзакцій

source: wallet transactions
uk: історія транзакцій

source: disabled
uk: вимкнено

source: error
uk: помилка

source: incomplete
uk: незавершений

source: ok
uk: ок

source: eve character
uk: персонаж EVE

source: created at
uk: створений

source: is shared
uk: спільне використання

source: is disabled
uk: вимкнений

source: mailing lists
uk: списки розсилки

source: character
uk: персонаж

source: characters
uk: персонажі

source: character update status
uk: стан оновлення персонажа

source: compliance group designation
uk: призначення групи відповідності

source: compliance group designations
uk: призначення групи відповідності

source: locations
uk: розташування

source: description
uk: опис

source: is doctrine
uk: є доктринним

source: This enables a skill set group to show up correctly in doctrine reports
uk: Вмикає групу навичок для коректного відображення у звітах доктрин

source: is active
uk: активний

source: Whether this skill set group is in active use
uk: Чи використовується ця група навичок активно

source: name
uk: ім'я

source: skill set group
uk: група навичок

source: skill set groups
uk: групи навичок

source: Doctrine:
uk: Доктрина:

source: is visible
uk: видимий

source: Non visible skill sets are not shown to users on their character sheet and used for audit purposes only.
uk: Невидимі групи навичок не відображаться для користувачів у їх листі персонажа та використовуються лише для аудиту

source: ship type
uk: тип корабля

source: Ship type is used for visual presentation only. All skill requirements must be explicitly defined.
uk: Тип корабля використовується лише для візуального відображення. Усі вимоги до навичок мають бути явно зазначені

source: skill set
uk: набір навичок

source: skill
uk: навичка

source: required level
uk: обов'язковий рівень

source: recommended level
uk: рекомендований рівень

source: Alliance
uk: Альянс

source: Character
uk: Персонаж

source: Corporation
uk: Корпорація

source: Mailing List
uk: Список розсилки

source: Unknown
uk: Невідомо

source: Delete
uk: Видалити

source: Cancel
uk: Скасувати

source: skill set from fitting
uk: набір навичок від зброї

source: skill set from skill plan
uk: набір навичок від плану

source: Home
uk: Головна

source: Characters
uk: Персонажі

source: Name
uk: Ім'я

source: Organization
uk: Організація

source: Main
uk: Головний

source: State
uk: Статус

source: Main character
uk: Головний персонаж

source: Currently shared with others
uk: Зараз спільно використовується іншими

source: Char Alliance
uk: Альянс Персонажа

source: Char Corporation
uk: Корпорація Персонажа

source: Main Alliance
uk: Головний Альянс

source: Main Corporation
uk: Головна Корпорація

source: Main?
uk: Головний?

source: Main State
uk: Статус Головного

source: Unregistered?
uk: Не зареєстрований?

source: Region
uk: Регіон

source: Solar System
uk: Сонячна система

source: Ship?
uk: Корабель?

source: Watched?
uk: В спостереженні?

source: Blocked?
uk: Заблокований?

source: Planet Type
uk: Тип планети

source: Group
uk: Група

source: Required Skills?
uk: Необхідні навички?

source: Doctrine?
uk: Доктрина?

source: Level
uk: Рівень

source: Buy and Sell
uk: Купля та продаж

source: Topics
uk: Теми

source: Description
uk: Опис

source: Rows
uk: Рядки

source: Export file age
uk: Вік файлу експорту

source: Export files contain the complete data of all %(amount_of_characters)s characters known to Member Audit.
uk: Файли експорту містять повні дані всіх %(amount_of_characters)s персонажів, відомих Member Audit.

source: They are in CSV format and zipped.
uk: Вони в форматі CSV і стиснуті.

source: Existing export files are updated after %(minutes_until_next_update)s minutes.
uk: Існуючі файли експорту оновлюються після %(minutes_until_next_update)s хвилин.

source: Register Character
uk: Зареєструвати персонажа

source: Register
uk: Зареєструвати

source: (no data yet)
uk: (поки що немає даних)

source: View this character.
uk: Переглянути цього персонажа.

source: Disable access to this character for recruiters.
uk: Вимкнути доступ до цього персонажа для рекрутерів.

source: Are you sure you want to allow others to see this character?
uk: Ви впевнені, що хочете дозволити іншим бачити цього персонажа?

source: Allow others to see this character.
uk: Дозволити іншим бачити цього персонажа.

source: Are you sure you want to remove this character?
uk: Ви впевнені, що хочете видалити цього персонажа?

source: Remove this character.
uk: Видалити цього персонажа.

source: Loading...
uk: Завантаження...

source: Close
uk: Закрити

source: Asset Container
uk: Контейнер інвентарю

source: Qty
uk: Кількість

source: Volume
uk: Об'єм

source: Price
uk: Ціна

source: Total
uk: Загальна сума

source: Grand Total:
uk: Загальна сума:

source: Required
uk: Обов'язкові

source: Recommended
uk: Рекомендовані

source: Current
uk: Поточні

source: Info by Issuer:
uk: Інформація від видачі:

source: Type:
uk: Тип:

source: Issued By:
uk: Видано ким:

source: Availability:
uk: Доступність:

source: Region:
uk: Регіон:

source: Status:
uk: Статус:

source: Location:
uk: Місце розташування:

source: Date Issued:
uk: Дата видачі:

source: Expiration Date:
uk: Дата закінчення:

source: Complete In:
uk: Завершити через:

source: Volume:
uk: Об'єм:

source: m3
uk: м³

source: Reward:
uk: Винагорода:

source: Collateral:
uk: Забезпечення:

source: Destination:
uk: Призначення:

source: Buyer will pay
uk: Покупець заплатить

source: Buyer will get
uk: Покупець отримає

source: Starting Bid:
uk: Початкова ставка:

source: Buyout Price:
uk: Викупна ціна:

source: Current Bid:
uk: Поточна ставка:

source: so far
uk: до цього часу

source: Time Left:
uk: Час що залишився:

source: Type
uk: Тип

source: Category
uk: Категорія

source: Mail
uk: Пошта

source: From:
uk: Від:

source: To:
uk: Кому:

source: Sent:
uk: Відправлено:

source: You meet all the required skills.
uk: Ви відповідаєте всім необхідним навичкам.

source: You do not meet the skill requirements
uk: Ви не відповідаєте вимогам до навичок

source: Copy missing skills to clipboard
uk: Скопіювати відсутні навички в буфер обміну

source: Legend:
uk: Легенда:

source: Below minimum requirements
uk: Нижче мінімальних вимог

source: Above required, but below recommended level
uk: Вище вимог, але нижче рекомендованого рівня

source: At/Above recommended level
uk: На/вище рекомендованого рівня

source: Main Currently shared with recruiters
uk: Головний зараз спільно використовується з рекрутерами

source: Overview
uk: Огляд

source: Character:
uk: Персонаж:

source: Corporation:
uk: Корпорація:

source: Alliance:
uk: Альянс:

source: Faction:
uk: Фракція:

source: Race:
uk: Раса:

source: Main:
uk: Головний персонаж:

source: Born:
uk: Дата народження:

source: Skillpoints:
uk: Навички:

source: Sec. Status:
uk: Статус безпеки:

source: Assets:
uk: Активи:

source: Wallet:
uk: Гаманець:

source: Ship:
uk: Корабель:

source: System:
uk: Система:

source: Last Login:
uk: Останній вхід:

source: Unregistered character
uk: Незареєстрований персонаж

source: (orphan)
uk: (сирота)

source: Currently shared with recruiters
uk: В даний момент доступно рекрутерам

source: Assets
uk: Активи

source: Location
uk: Місцезнаходження

source: Volume (m3)
uk: Об'єм (м³)

source: Prices are average market prices.
uk: Ціни є середніми ринковими цінами.

source: Attributes
uk: Атрибути

source: Perception
uk: Сприйняття

source: points
uk: бали

source: Memory
uk: Пам'ять

source: Willpower
uk: Сила волі

source: Intelligence
uk: Інтелект

source: Charisma
uk: Харизма

source: Neural Remap Available:
uk: Доступна переналаштування нейронів:

source: Bonus Remaps Available:
uk: Доступні бонусні переналаштування:

source: Bio
uk: Біо

source: Contacts
uk: Контакти

source: Standing
uk: Репутація

source: Standing Value
uk: Значення репутації

source: Contracts
uk: Контракти

source: Contract
uk: Контракт

source: From
uk: Від

source: To
uk: Кому

source: Status
uk: Статус

source: Date Issued
uk: Дата видачі

source: Time Left
uk: Час до завершення

source: Info
uk: Інформація

source: History
uk: Історія

source: (Closed)
uk: (Закрито)

source: Today
uk: Сьогодні

source: Faction Warfare
uk: Фракційна війна

source: Faction
uk: Фракція

source: Not enlisted
uk: Не зараховано

source: Enlisted on
uk: Зараховано

source: Current rank
uk: Поточний ранг

source: Highest rank
uk: Найвищий ранг

source: Kills
uk: Вбивства

source: Yesterday
uk: Вчора

source: Last week
uk: Минулого тижня

source: Victory Points
uk: Бали перемоги

source: Implants
uk: Імпланти

source: No implants
uk: Імплантів немає

source: Jump Clones
uk: Клони переміщення

source: System
uk: Система

source: Loyalty
uk: Лояльність

source: Loyalty Points
uk: Бали лояльності

source: Mails
uk: Пошта

source: Sent
uk: Відправлено

source: Subject
uk: Тема

source: Mining
uk: Видобуток

source: Date
uk: Дата

source: Quantity
uk: Кількість

source: Planets
uk: Планети

source: Planet
uk: Планета

source: Skill Queue
uk: Черга навчання

source: Skill
uk: Навичка

source: Finished
uk: Завершено

source: Position
uk: Позиція

source: Skill Sets
uk: Групи навичок

source: Skill Set Group
uk: Група груп навичок

source: Skill Set
uk: Група навичок

source: Has all required?
uk: Має всі необхідні?

source: Missing Required Skills
uk: Відсутні необхідні навички

source: Missing Recommended Skills
uk: Відсутні рекомендовані навички

source: Skills
uk: Навички

source: Transactions
uk: Транзакції

source: First party
uk: Перша сторона

source: Second party
uk: Друга сторона

source: Amount
uk: Сума

source: Balance
uk: Баланс

source: Market Transactions
uk: Транзакції на ринку

source: Unit Price
uk: Ціна за одиницю

source: Client
uk: Клієнт

source: Where
uk: Де

source: Clones
uk: Клони

source: Industry
uk: Промисловість

source: Wallet
uk: Гаманець

source: Toggle navigation
uk: Перемкнути навігацію

source: My Characters
uk: Мої персонажі

source: Character Sheet
uk: Аркуш персонажа

source: Character Finder
uk: Пошук персонажів

source: Reports
uk: Звіти

source: Data Export
uk: Експорт даних

source: Color code:
uk: Код кольору:

source: fully compliant
uk: повністю відповідає

source: partly compliant
uk: частково відповідає

source: not compliant
uk: не відповідає

source: Total Users
uk: Загальна кількість користувачів

source: Total Characters
uk: Загальна кількість персонажів

source: Compliance %%
uk: Відповідність %%

source: Is Main?
uk: Основний?

source: User
uk: Користувач

source: Registered?
uk: Зареєстрований?

source: Compliant?
uk: Відповідає?

source: Total Chars
uk: Загальна кількість персонажів

source: User Compliance
uk: Відповідність користувача

source: Corporation Compliance
uk: Відповідність корпорації

source: Groups
uk: Групи

source: [Ungrouped]
uk: [Без групи]

source: Skill Set %s has been created
uk: Набір навичок %s створено

source: Skill Set %s has been updated
uk: Набір навичок %s оновлено

source: Create skill set from fitting
uk: Створити набір навичок зі зброєвим обладнанням

source: Create skill set from skill plan
uk: Створити набір навичок з плану навичок

source: You do not own this character
uk: Ви не володієте цим персонажем

source: Mail with pk %s not found for character %s
uk: Поштове повідомлення з pk %s не знайдено для персонажа %s

source: (training not active)
uk: (навчання не активне)

source: Buy
uk: Купити

source: Sell
uk: Продати

source: Data export for topic %s has been started. This can take a couple of minutes. You will get a notification once it is completed.
uk: Розпочато експорт даних для теми %s. Це може зайняти кілька хвилин. Ви отримаєте повідомлення, якщо він буде завершено.
