Repository: pypi-data/pypi-mirror-383
Catalog: packages/aa-blueprints/aa_blueprints-1.8.0.tar.gz/aa_blueprints-1.8.0/blueprints/locale/*/LC_MESSAGES/django.po
Languages: de, es

source: Blueprint Library
de: Blaupausenbibliothek
es: Biblioteca de planos

source: Manufacturing
de: Fertigung
es: Fabricación

source: Researching Technology
de: Technologie erforschen
es: Investigación de Tecnología

source: Researching Time Efficiency
de: Erforschen der Zeiteffizienz
es: Investigar la eficiencia del tiempo

source: Researching Material Efficiency
de: Erforschung der materiellen Effizienz
es: Investigación de la eficiencia de los materiales

source: Copying
de: kopiert
es: Copiar

source: Duplicating
de: Duplizieren
es: Duplicación

source: Reverse Engineering
es: Ingeniería inversa

source: Inventing
de: Erfinden
es: Inventar

source: Reacting
de: Reagieren
es: Reaccionar

source: Library
de: Die Bibliothek
es: Biblioteca

source: My Requests
de: Meine Anfragen
es: Mis Solicitudes

source: Open Requests
de: Offene Anfragen
es: Solicitudes abiertas

source: Manage Blueprints
de: Verwalten von Blueprints
es: Administrar blueprints

source: Type
de: Typ
es: Tipo

source: Quantity
de: Menge
es: Cantidad

source: Qty
de: Menge
es: Cant.

source: Owner
de: Inhaber
es: Propietario

source: Material Efficiency
de: Materielle Effizienz
es: Eficiencia material

source: Time Efficiency
de: Zeitliche Effizienz
es: Eficiencia temporal

source: Runs Remaining
de: Verbleibende Läufe
es: Runciones restantes

source: Blueprints in use are highlighted in blue.
de: Die verwendeten Blaupausen sind blau hervorgehoben.
es: Los planos en uso se resaltan en azul.

source: Runs
de: läuft
es: Corridas

source: Requested From
de: Angefragt von
es: Solicitada desde

source: Requestor
de: Anforderer
es: Solicitante

source: Add My Blueprints
de: Meine Blueprints hinzufügen
es: Agregar mis blueprints

source: Add Corporation Blueprints
de: Corporation Blueprints hinzufügen
es: Agregar blueprints de corporación

source: Name
de: Nennen
es: Nombre

source: Location
de: Standort
es: Ubicación

source: Is BPO?
de: Ist BPO?
es: ¿Es BPO?

source: View Blueprint
de: Blueprint ansehen
es: Ver blueprint

source: Mark Request as Cancelled
de: Antrag als storniert markieren
es: Marcar solicitud como cancelada

source: Mark Request as Fulfilled
de: Antrag als erfüllt markieren
es: Marcar solicitud como gestionada

source: Mark Request as In Progress
de: Antrag als in Bearbeitung markieren
es: Marcar solicitud como en curso

source: Mark Request as Open
de: Antrag als offen markieren
es: Marcar solicitud como abierta

source: Create Request
de: Anfrage erstellen
es: Crear solicitud

source: Request Information
de: Informationen anfordern
es: Solicitar información

source: Remove Blueprints
de: Blueprints entfernen
es: Quitar blueprints

source: Loading...
de: Wird geladen...
es: Cargando...

source: Summary
de: Zusammenfassung
es: Resumen

source: Current Job
de: Derzeitiger Job
es: Trabajo actual

source: Blueprint Location
de: Blueprint-Standort
es: Ubicación del blueprint

source: Activity
de: Die Aktivität
es: Actividad

source: Installer
de: Installateur
es: Instalador

source: Start Date
de: Startdatum
es: Fecha de inicio

source: End Date
de: Enddatum
es: Fecha de finalización

source: View Request
de: Anfrage ansehen
es: Ver solicitud

source: Blueprint Type
de: Blueprint-Typ
es: Tipo de blueprint

source: %(value)s is not a valid material efficiency
de: %(value)s ist keine gültige Materialeffizienz
es: %(value)s no es una eficiencia de material válida

source: %(value)s is not a valid time efficiency
de: %(value)s ist keine gültige Zeiteffizienz
es: %(value)s no es una eficiencia de tiempo válida

source: You can only use your main or alt characters to add corporations. However, character %s is neither.
de: Du kannst nur deine Haupt- oder Alt-Charaktere verwenden, um Corporations hinzuzufügen. Der Charakter %s ist jedoch keines von beiden.
es: Solo puedes usar tus caracteres principales o alternativos para añadir corporaciones. Sin embargo, el carácter %s no es ninguno de los dos.

source: %(corporation)s has been added with %(character)s as sync character. We have started fetching blueprints for this corporation. You will receive a report once the process is finished.
de: %(corporation)s wurde mit %(character)s als Synchronisierungscharakter hinzugefügt. Wir haben damit begonnen, Blaupausen für diese Corporation zu laden. Sie erhalten einen Bericht, sobald der Prozess abgeschlossen ist.
es: %(corporation)s se ha añadido con %(character)s como carácter de sincronización. Hemos empezado a buscar planos para esta corporación. Recibirá un informe una vez finalizado el proceso.

source: %(corporation)s was added as new corporate blueprint owner by %(user)s.
de: %(corporation)s wurde von %(user)s als neuer Eigentümer eines Unternehmens-Blueprints hinzugefügt.
es: %(corporation)s fue agregado como nuevo propietario del blueprint corporativo por %(user)s.

source: %(character)s has been added. We have started fetching blueprints for this character. You will receive a report once the process is finished.
de: %(character)s wurde hinzugefügt. Wir haben damit begonnen, Blaupausen für diesen Charakter zu holen. Sie erhalten einen Bericht, sobald der Prozess abgeschlossen ist.
es: se ha añadido %(character)s. Hemos empezado a buscar planos para este personaje. Recibirá un informe una vez finalizado el proceso.

source: %(character)s was added as a new personal blueprint owner.
de: %(character)s wurde als neuer Besitzer eines persönlichen Blueprints hinzugefügt.
es: %(character)s se agregó como un nuevo propietario de blueprint personal.

source: Yes
de: ja
es: Sí

source: Corporate
es: Corporativo

source: A copy of %(blueprint)s has been requested.
de: Eine Kopie von %(blueprint)s wurde angefordert.
es: Se ha solicitado una copia de %(blueprint)s.

source: The request for %(blueprint)s has been closed as fulfilled.
de: Die Anfrage für %(blueprint)s wurde als erfüllt geschlossen.
es: La solicitud de %(blueprint)s se ha cerrado como cumplida.

source: Fulfilling the request for %(blueprint)s has failed.
de: Das Ausfüllen der Anfrage für %(blueprint)s ist fehlgeschlagen.
es: Se ha producido un error al cumplir la solicitud de %(blueprint)s.

source: The request for %(blueprint)s has been marked as in progress.
de: Der Antrag auf %(blueprint)s wurde als in Bearbeitung markiert.
es: La solicitud de %(blueprint)s ha sido marcada como en curso.

source: Marking the request for %(blueprint)s as in progress has failed.
de: Das Markieren der Anfrage für %(blueprint)s als in Bearbeitung ist fehlgeschlagen.
es: Error al marcar la solicitud de %(blueprint)s como en curso.

source: The request for %(blueprint)s has been re-opened.
de: Die Anfrage für %(blueprint)s wurde erneut geöffnet.
es: Se ha vuelto a abrir la solicitud de %(blueprint)s.

source: Re-opening the request for %(blueprint)s has failed.
de: Das erneute Öffnen der Anfrage für %(blueprint)s ist fehlgeschlagen.
es: Error al volver a abrir la solicitud de %(blueprint)s.

source: The request for %(blueprint)s has been closed as cancelled.
de: Der Antrag für %(blueprint)s wurde wie storniert geschlossen.
es: La solicitud de %(blueprint)s se ha cerrado como cancelada.

source: Cancelling the request for %(blueprint)s has failed.
de: Das Abbrechen der Anfrage für %(blueprint)s ist fehlgeschlagen.
es: Error al cancelar la solicitud de %(blueprint)s.

source: %(owner)s has been removed as a blueprint owner.
es: %(owner)s se ha eliminado como propietario del blueprint.

source: Removing the blueprint owner has failed.
de: Das Entfernen des Blueprint-Besitzers ist fehlgeschlagen.
es: Error al quitar el propietario del blueprint.

source: No
de: Nein

source: Personal
de: Persönlich
