Repository: pypi-data/pypi-mirror-383
Catalog: packages/aratinga/aratinga-0.1.0a0.dev3-py3-none-any.whl/aratinga/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Custom CSS Class
pt_br: Classe CSS Customizada

source: Custom ID
pt_br: ID Padrão

source: Advanced Settings
pt_br: Configurações Avançadas

source: Template
pt_br: Modelo

source: Column Breakpoint
pt_br: Ponto de Interrupção de Coluna

source: Screen size at which the column will expand horizontally or stack vertically.
pt_br: Tamanho da tela no qual a coluna se expandirá horizontalmente ou empilhará verticalmente.

source: Button Style
pt_br: Estilo do botão

source: Button Size
pt_br: Tamanho do Botão

source: Content
pt_br: Conteúdo

source: Page link
pt_br: Link da página

source: Document link
pt_br: Link do documento

source: Other link
pt_br: Outro Link

source: Title
pt_br: Título

source: Image
pt_br: Imagem

source: Subtitle
pt_br: Subtítulo

source: Body
pt_br: Corpo

source: Card
pt_br: Cartão

source: Carousel
pt_br: Carrossel

source: Image Collection
pt_br: Coleção de Imagens

source: Image Gallery
pt_br: Galeria de Imagens

source: Button Link
pt_br: Link do botão

source: Download
pt_br: Baixar

source: Search query
pt_br: Pesquisa

source: Address or search term used to find your location on the map.
pt_br: Endereço ou termo de pesquisa usado para encontrar sua localização no mapa.

source: Map title
pt_br: Título do mapa

source: Map title for screen readers, ex: "Map to Goodale Park"
pt_br: Título do mapa para leitores de tela, por exemplo: "Mapa para Complexo Poli-esportivo Ayrton Senna da Silva"

source: Google place ID
pt_br: ID do lugar do Google

source: Requires API key to use place ID.
pt_br: Requer chave de API para usar o ID do local.

source: Map zoom level
pt_br: Nível de zoom do mapa

source: Requires API key to use zoom. 1: World, 5: Landmass/continent, 10: City, 15: Streets, 20: Buildings
pt_br: Requer chave de API para usar o zoom. 1: Mundo, 5: Massa de terra/continente, 10: Cidade, 15: Ruas, 20: Edifícios

source: Google Map
pt_br: Mapa do Google

source: Link to a YouTube/Vimeo video, tweet, facebook post, etc.
pt_br: Link para um vídeo do YouTube/Vimeo, tweet, postagem no Facebook, etc.

source: Embed Media
pt_br: Incorporar mídia

source: Alternate text to show if the image doesn’t load
pt_br: Texto alternativo para mostrar se a imagem não carrega

source: Image Link
pt_br: Link da imagem

source: Parent page
pt_br: Página pai

source: Show a preview of pages that are children of the selected page. Uses ordering specified in the page’s LAYOUT tab.
pt_br: Mostre uma visualização das páginas que são filhas da página selecionada. Usa a ordem especificada na guia LAYOUT da página.

source: Classified as
pt_br: Classificado como

source: Only show pages that are classified with this term.
pt_br: Mostrar apenas páginas classificadas com este termo.

source: Show body preview
pt_br: Mostrar visualização do corpo

source: Number of pages to show
pt_br: Número de páginas a serem exibidas

source: Latest Pages
pt_br: Últimas páginas

source: Page to preview
pt_br: Página para visualizar

source: Show a mini preview of the selected page.
pt_br: Mostre uma mini visualização da página selecionada.

source: Page Preview
pt_br: Visualização da página

source: Quote Text
pt_br: Texto de citação

source: Author
pt_br: Autor

source: Quote
pt_br: Citação

source: Column size
pt_br: Tamanho da coluna

source: Full width
pt_br: Largura total

source: Responsive Grid Row
pt_br: Linha de grade responsiva

source: Card Grid
pt_br: Grade de Cartões

source: Parallax Effect
pt_br: Efeito de paralaxe

source: Background images scroll slower than foreground images, creating an illusion of depth.
pt_br: As imagens de fundo rolam mais lentamente do que as imagens de primeiro plano, criando uma ilusão de profundidade.

source: Tile background image
pt_br: Imagem de fundo lado a lado

source: Background color
pt_br: Cor de fundo

source: Hexadecimal, rgba, or CSS color notation (e.g. #ff0011)
pt_br: Notação de cores hexadecimal, rgba ou CSS (por exemplo, #ff0011)

source: Text color
pt_br: Cor do texto

source: Search
pt_br: Pesquisa

source: Page type
pt_br: Tipo de página

source: File to import
pt_br: Arquivo a ser importado

source: Destination parent page
pt_br: Página pai de destino

source: Imported pages will be created as children of this page.
pt_br: As páginas importadas serão criadas como filhas desta página.

source: Aratinga Tag
pt_br: Tag do Aratinga

source: Aratinga Page
pt_br: Página do Aratinga

source: Default Ordering
pt_br: Ordenação padrão

source: Date first published, newest to oldest
pt_br: Data da primeira publicação, do mais recente para o mais antigo

source: Date first published, oldest to newest
pt_br: Data da primeira publicação, do mais antigo para o mais recente

source: Date updated, newest to oldest
pt_br: Data de atualização, do mais recente para o mais antigo

source: Date updated, oldest to newest
pt_br: Data de atualização, do mais antigo para o mais recente

source: Title, alphabetical
pt_br: Título, alfabético

source: Title, reverse alphabetical
pt_br: Título, alfabético reverso

source: Order child pages by
pt_br: Ordenar páginas secundárias por

source: Child pages will then be sorted by this attribute.
pt_br: As páginas secundárias serão classificadas por esse atributo.

source: Classifiers
pt_br: Classificadores

source: Categorize and group pages together with classifiers. Used to organize and filter pages across the site.
pt_br: Categorize e agrupe páginas com classificadores. Usado para organizar e filtrar páginas em todo o site.

source: Tags
pt_br: Marcadores

source: Used to organize pages across the site.
pt_br: Usado para organizar páginas em todo o site.

source: Classify
pt_br: Classificar

source: Promote
pt_br: Promover

source: Aratinga Web Page
pt_br: Página Web do Aratinga

source: Aratinga Article
pt_br: Artigo do Aratinga

source: Caption
pt_br: Legenda

source: Display author as
pt_br: Exibir autor como

source: Override how the author’s name displays on this article.
pt_br: Substitua como o nome do autor é exibido neste artigo.

source: Display publish date
pt_br: Exibir data de publicação

source: Publication Info
pt_br: Informações da Publicação

source: Aratinga Article Index Page
pt_br: Página de índice do artigo do Aratinga

source: Show images
pt_br: Mostrar imagens

source: Show author and date info
pt_br: Mostrar informações sobre o autor e a data

source: Show preview text
pt_br: Mostrar texto de visualização

source: Brand logo used in the navbar and throughout the site
pt_br: Logotipo da marca usado na barra de navegação e em todo o site

source: Title suffix
pt_br: Sufixo do título

source: The suffix for the title meta tag e.g. ' | The Jandaya Institute'
pt_br: O sufixo para a meta tag do título, por exemplo, ' | Instituto Jandaia'

source: The Jandaya Institute
pt_br: Instituto Jandaia

source: CMS Settings
pt_br: Configurações do CMS

source: From email address
pt_br: Endereço de e-mail do remetente

source: The default email address this site appears to send from. For example: "sender@example.com" or "Sender Name <sender@example.com>" (without quotes)
pt_br: O endereço de e-mail padrão do qual este site parece enviar. Por exemplo: "remetente@exemplo.com.br" ou "Nome do remetente <remetente@exemplo.com.br>" (sem aspas)

source: Number of results per page
pt_br: Número de resultados por página

source: Open all external links in new tab
pt_br: Abrir todos os links externos em uma nova guia

source: Google Maps API Key
pt_br: Chave de API do Google Maps

source: The API Key used for Google Maps.
pt_br: A chave de API usada para o Google Maps.

source: Mailchimp API Key
pt_br: Chave de API do Mailchimp

source: The API Key used for Mailchimp.
pt_br: A chave de API usada para o Mailchimp.

source: Classifier
pt_br: Classificador

source: Name
pt_br: Nome

source: Classifier Terms
pt_br: Termos do Classificador

source: Classifier Term
pt_br: Termo do classificador

source: Show controls
pt_br: Mostrar controles

source: Shows arrows on the left and right of the carousel to advance next or previous slides.
pt_br: Mostra setas à esquerda e à direita do carrossel para avançar os slides seguintes ou anteriores.

source: Show indicators
pt_br: Mostrar indicadores

source: Shows small indicators at the bottom of the carousel based on the number of slides.
pt_br: Mostra pequenos indicadores na parte inferior do carrossel com base no número de slides.

source: Slider
pt_br: Controle deslizante

source: Slides
pt_br: Apresentações

source: Carousel Slide
pt_br: Slide carrossel

source: Custom CSS class
pt_br: Classe CSS personalizada

source: English
pt_br: Inglês

source: Portuguese (Brazil)
pt_br: Português (Brasil)

source: Article
pt_br: Artigo

source: Article Landing Page
pt_br: Página inicial de artigos

source: Web Page
pt_br: Página web

source: Small
pt_br: Pequeno

source: Default
pt_br: Padrão

source: Large
pt_br: Grande

source: Primary
pt_br: Primário

source: Secondary
pt_br: Secundário

source: Success
pt_br: Sucesso

source: Danger
pt_br: Perigo

source: Warning
pt_br: Aviso

source: Info
pt_br: Informação

source: Light
pt_br: Claro

source: Dark
pt_br: Escuro

source: Outline Primary
pt_br: Contorno Primário

source: Outline Secondary
pt_br: Contorno Secundário

source: Outline Success
pt_br: Contorno de Sucesso

source: Outline Danger
pt_br: Contorno de Perigo

source: Outline Warning
pt_br: Contorno de Aviso

source: Outline Info
pt_br: Contorno de Informação

source: Outline Light
pt_br: Contorno Claro

source: Outline Dark
pt_br: Contorno Escuro

source: Automatically size
pt_br: Dimensionar automaticamente

source: Full row
pt_br: Linha completa

source: Half - 1/2 column
pt_br: Metade - 1/2 coluna

source: Thirds - 1/3 column
pt_br: Terços - 1/3 coluna

source: Thirds - 2/3 column
pt_br: Terços - 2/3 coluna

source: Quarters - 1/4 column
pt_br: Quartos - 1/4 de coluna

source: Quarters - 3/4 column
pt_br: Quartos - 3/4 coluna

source: Sixths - 1/6 column
pt_br: Sextos - 1/6 coluna

source: Sixths - 5/6 column
pt_br: Sextos - 5/6 coluna

source: Twelfths - 1/12 column
pt_br: Duodécimos - 1/12 coluna

source: Twelfths - 5/12 column
pt_br: Duodécimos - 5/12 coluna

source: Twelfths - 7/12 column
pt_br: Duodécimos - 7/12 coluna

source: Twelfths - 11/12 column
pt_br: Duodécimos - 11/12 coluna

source: Always expanded
pt_br: Sempre expandido

source: sm - Expand on small screens (phone, 576px) and larger
pt_br: sm - Expanda em telas pequenas (telefone, 576px) e maiores

source: md - Expand on medium screens (tablet, 768px) and larger
pt_br: md - Expanda em telas médias (tablet, 768px) e maiores

source: lg - Expand on large screens (laptop, 992px) and larger
pt_br: lg - Expanda em telas grandes (laptop, 992px) e maiores

source: xl - Expand on extra large screens (wide monitor, 1200px)
pt_br: xl - Expanda em telas extra grandes (monitor amplo, 1200px)

source: Web page showing title and cover image
pt_br: Página da Web mostrando título e imagem de capa

source: Web page without title and cover image
pt_br: Página da Web sem título e imagem de capa

source: Home page without title and cover image
pt_br: Página inicial sem título e imagem de capa

source: Blank page - no navbar or footer
pt_br: Página em branco - sem barra de navegação ou rodapé

source: Card with header
pt_br: Cartão com cabeçalho

source: Card with footer
pt_br: Cartão com rodapé

source: Card with header and footer
pt_br: Cartão com cabeçalho e rodapé

source: Blurb - rounded image and no border
pt_br: Sinopse - imagem arredondada e sem borda

source: Cover image - use image as background
pt_br: Imagem da capa - use a imagem como plano de fundo

source: Card group - attached cards of equal size
pt_br: Grupo de cartas - cartas anexadas de tamanho igual

source: Card deck - separate cards of equal size
pt_br: Baralho de cartas - cartas separadas de tamanho igual

source: Card masonry - fluid brick pattern
pt_br: Mural de cartões - padrão de bloco fluido

source: Previous
pt_br: Anterior

source: Next
pt_br: Próximo

source: Organize Pages with Classifiers
pt_br: Organizar páginas com classificadores

source: Use Classifiers to create custom categories and filters.
pt_br: Use classificadores para criar categorias e filtros personalizados.

source: Add Classifier
pt_br: Adicionar classificador

source: Sign in to Aratinga
pt_br: Faça login no Aratinga

source: Aratinga themes
pt_br: Temas de Aratinga

source: themes
pt_br: temas

source: Themes
pt_br: Temas

source: Add a theme
pt_br: Adicionar um tema

source: Theme
pt_br: Tema

source: Active?
pt_br: Ativo?

source: Active
pt_br: Ativo

source: Add theme
pt_br: Adicionar tema

source: Theme '%(object)s' created.
pt_br: Tema '%(object)s' criado.

source: The theme could not be saved due to errors.
pt_br: O tema não pôde ser salvo devido a erros.

source: Theme '%(object)s' updated.
pt_br: Tema '%(object)s' atualizado.

source: Delete theme
pt_br: Excluir tema

source: Theme '%(object)s' deleted.
pt_br: Tema '%(object)s' excluído.

source: Theme site
pt_br: Tema do Site

source: Are you sure you want to delete this theme?
pt_br: Tem certeza de que deseja excluir este tema?
