#          █▄▀ ▄▀█ █▀▄▀█ █▀▀ █▄▀ █  █ █▀█ █▀█
#          █ █ █▀█ █ ▀ █ ██▄ █ █ ▀▄▄▀ █▀▄ █▄█ ▄
#                © Copyright 2025
#            ✈ https://t.me/kamekuro
# 🔒      Licensed under the GNU AGPLv3
# 🌐 https://www.gnu.org/licenses/agpl-3.0.html

import dataclasses
import datetime
from typing import TYPE_CHECKING, List

from aionetschool.types import JSONType, NSObject, model
from aionetschool.types.attachment import Attachment

if TYPE_CHECKING:
    from aionetschool.client import NetSchoolAPI


@model
class Author:
    id: int
    full_name: str
    nickname: str


@model
class Announcement(NSObject):
    description: str = dataclasses.field(metadata=dict(required=False))
    post_date: datetime.datetime = dataclasses.field(
        metadata=dict(data_key="postDate", required=False)
    )
    delete_date: datetime.datetime = dataclasses.field(
        metadata=dict(data_key="deleteDate", required=False)
    )
    author: Author = dataclasses.field(metadata=dict(required=False))
    em: dict = dataclasses.field(
        metadata=dict(required=False)
    )  # {"id": 431078, "name": "Минобр Челябинской области"}
    recipient_info: dict = dataclasses.field(
        metadata=dict(data_key="recipientInfo", required=False)
    )
    attachments: List = dataclasses.field(metadata=dict(required=False))
    id: int = dataclasses.field(metadata=dict(required=False))
    name: str = dataclasses.field(metadata=dict(required=False))
    client: "NetSchoolAPI" = None

    @classmethod
    def de_json(cls, data: JSONType, client: "NetSchoolAPI"):
        if not cls.is_dict_model_data(data):
            return None

        cls_data: dict = cls.cleanup_data(data)
        cls_data["author"] = Author(
            cls_data["author"]["id"],
            cls_data["author"]["fio"],
            cls_data["author"]["nickName"],
        )
        if cls_data.get("attachments"):
            cls_data["attachments"] = [
                Attachment.de_json(x, client) for x in cls_data["attachments"]
            ]
        return cls(client=client, **cls_data)


"""
[
    {
        "description": "<p>13 октября (7-11 классы)&amp;#160; &amp;#160;сайте&amp;#160;<a href=\"https://uts.sirius.online/\" target=\"_blank\">https://uts.sirius.online</a>&amp;#160;будет проходить олимпиада по химии. Свой код можно посмотреть в прикрепленном файле</p>",
        "postDate": "2025-10-13T13:16:52.953",
        "deleteDate": null,
        "author": {
            "id": 40066,
            "fio": "Ершова Анна Олеговна",
            "nickName": "Ершова Анна Олеговна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 34046647,
                "name": "химия.xlsx",
                "originalFileName": "химия.xlsx",
                "description": null
            }
        ],
        "id": 1309550,
        "name": "химия"
    },
    {
        "description": "<p>9 октября (5-6 классы) и 10 октября (7-11 классы) &amp;#160;сайте&amp;#160;<a href=\"https://uts.sirius.online/\" target=\"_blank\">https://uts.sirius.online</a>&amp;#160;будет проходить олимпиада по биологии. Свой код можно посмотреть в прикрепленном файле</p>",
        "postDate": "2025-10-08T08:28:27.513",
        "deleteDate": null,
        "author": {
            "id": 40066,
            "fio": "Ершова Анна Олеговна",
            "nickName": "Ершова Анна Олеговна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 34014510,
                "name": "биология.xlsx",
                "originalFileName": "биология.xlsx",
                "description": null
            }
        ],
        "id": 1308921,
        "name": "Олимпиада по биологии"
    },
    {
        "description": "<p>Для участия в Слете всем участникам необходимо в срок до 8 октября 2025 г включительно пройти регистрацию по ссылке</p>\n<p>Ссылка на регистрацию на мероприятие https://forms.yandex.ru/u/68c8ff9784227c3c017b39bb</p>\n<p>Ссылка на трансляцию мероприятия https://vkvideo.ru/video-217101015_456239047</p>\n<p>(дополнительно можно поучаствовать в Конкурсе в группе ВК https://vk.com/chelnou)</p>",
        "postDate": "2025-10-07T18:02:14.86",
        "deleteDate": null,
        "author": {
            "id": 470158,
            "fio": "Осадчая Светлана Станиславна",
            "nickName": "Осадчая Светлана Станиславна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 34011590,
                "name": "Программа_СЛЕТ НОУ_2025.docx",
                "originalFileName": "Программа_СЛЕТ НОУ_2025.docx",
                "description": null
            },
            {
                "id": 34011594,
                "name": "2114-у от 22.09.2025.pdf",
                "originalFileName": "2114-у от 22.09.2025.pdf",
                "description": null
            }
        ],
        "id": 1308737,
        "name": "Слет НОУ «Я намечаю путь к открытию» для 7-11 классов"
    },
    {
        "description": "<p>Открыта запись на бесплатное обучение школьников 8&amp;#160;-&amp;#160;11 классов <br/>и студентов колледжей базовым навыкам искусственного интеллекта на цифровых образовательных платформах в проекте &amp;#171;Код будущего. Искусственный интеллект&amp;#187;*.</p>\n<p>На портале Госуслуг можно выбрать 1 из 6 курсов от 5 образовательных организаций: Цифриум, Яндекс, МФТИ, 1Т, Московская школа программистов.</p>\n<p>Преимущества обучения в проекте:</p>\n<p>полностью бесплатное обучение;</p>\n<p>самостоятельное изучение дистанционного курса;</p>\n<p>54 академических часа теории и практики;</p>\n<p>сертификат об окончании обучения.</p>\n<p>Подать заявление может как сам обучающийся, так и его родитель (законный представитель). Для этого потребуется подтвержденная учетная запись на Госуслугах и справка об обучении.</p>\n<p>Успей подать заявление на <a href=\"https://www.gosuslugi.ru/ai\" target=\"_blank\">https://www.gosuslugi.ru/ai</a>.</p>\n<p>* <em>Проект &amp;#171;Код будущего. Искусственный интеллект&amp;#187; реализуется Минцифры России в рамках федерального проекта &amp;#171;Кадры для цифровой трансформации&amp;#187; национального проекта &amp;#171;Экономика данных и цифровая трансформация государства&amp;#187;</em></p>",
        "postDate": "2025-10-03T07:42:44.277",
        "deleteDate": null,
        "author": {
            "id": 4286029,
            "fio": "Администратор Системы ",
            "nickName": "Администратор Системы"
        },
        "em": {
            "id": 431078,
            "name": "Минобр Челябинской области"
        },
        "recipientInfo": null,
        "attachments": [],
        "id": 1308301,
        "name": "Бесплатное обучение школьников 8 - 11 классов и студентов колледжей искусственному интеллекту"
    },
    {
        "description": "<p>2 октября на сайте <a href=\"https://uts.sirius.online/\" target=\"_blank\">https://uts.sirius.online</a> будет проходить олимпиада по физике. Свой код можно посмотреть в прикрепленном файле</p>",
        "postDate": "2025-09-29T08:42:09.5",
        "deleteDate": null,
        "author": {
            "id": 40066,
            "fio": "Ершова Анна Олеговна",
            "nickName": "Ершова Анна Олеговна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33947725,
                "name": "физика.xlsx",
                "originalFileName": "физика.xlsx",
                "description": null
            }
        ],
        "id": 1307443,
        "name": "Коды Сириус физика"
    },
    {
        "description": "<p>Уважаемые классные руководители! Необходимо принять в работу! Сдать заместителям директора по ВР до 10 октября.</p>",
        "postDate": "2025-09-29T07:37:35.703",
        "deleteDate": null,
        "author": {
            "id": 578994,
            "fio": "Шагеева Ольга Викторовна",
            "nickName": "Шагеева Ольга Викторовна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33947427,
                "name": "Планирование деятельности классного руководителя.doc",
                "originalFileName": "Планирование деятельности классного руководителя.doc",
                "description": null
            }
        ],
        "id": 1307432,
        "name": "Планирование деятельности классного руководителя."
    },
    {
        "description": "<p>В четверг 25 сентября на сайте <a href=\"https://siriusolymp.ru/\" target=\"_blank\">https://siriusolymp.ru</a>/, будет проходить школьный этап олимпиады по астрономии, принимаем активное участие.</p>",
        "postDate": "2025-09-24T10:59:36.387",
        "deleteDate": null,
        "author": {
            "id": 525007,
            "fio": "Овсянникова Татьяна Владимировна",
            "nickName": "Овсянникова Татьяна Владимировна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33915360,
                "name": "астрономия.xlsx",
                "originalFileName": "астрономия.xlsx",
                "description": null
            }
        ],
        "id": 1306814,
        "name": "Олимпиада по астрономии"
    },
    {
        "description": "<p>Уважаемые коллеги, родители и обучающиеся начинаем подготовку проектов и исследований к конкурсу &amp;quot;Интеллектуалы 21 века&amp;quot;</p>\n<p>по физико-математическому направлению предусмотрена работа секций:</p>\n<p>Секция 1. Физические науки (физика, проблемы энергетики).</p>\n<p>Секция 2.1. Математические науки (прикладная математика, математическое моделирование).</p>\n<p>Секция 2.2. Математические науки (программирование, информационные технологии).</p>\n<p>Секция 3. Астрономия и изучение космического пространства (теоретическая и наблюдательная астрономия, астрофизика, космология, планетология, изучение космического пространства).</p>\n<p>&amp;#160;</p>",
        "postDate": "2025-09-24T00:07:45.873",
        "deleteDate": null,
        "author": {
            "id": 470158,
            "fio": "Осадчая Светлана Станиславна",
            "nickName": "Осадчая Светлана Станиславна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [],
        "id": 1306783,
        "name": "«Интеллектуалы XXI века». Физико-математическое направление:"
    },
    {
        "description": "<p>Уважаемые коллеги, родители и обучающиеся начинаем подготовку проектов и исследований к конкурсу &amp;quot;Интеллектуалы 21 века&amp;quot;</p>\n<p>по естественно-научному направлению предусмотрена работа секций:</p>\n<p>Секция 4. Науки о Земле (геология, география, природопользование, сельское хозяйство).</p>\n<p>Секция 5. Ботаника и экология растений и грибов (высшие и низшие растения, грибы, лишайники).</p>\n<p>Секция 6. Зоология и экология животных (позвоночные, беспозвоночные, содержание животных в неволе).</p>\n<p>Секция 7. Здоровье и экология человека (здоровьесбережение, медицина, фармакология, адаптация человека к факторам среды).</p>\n<p>Секция 8. Агроэкология (растениеводство, домашняя ферма, ландшафтный дизайн, умное сельское хозяйство и сити-фермерство).</p>\n<p>Секция 9. Экологический мониторинг (биоиндикация, биотестирование, мониторинг состояния компонентов окружающей среды).</p>\n<p>Секция 10. Лесное дело (лесовосстановление, лесоразведение, охрана и защита лесов, оценка состояния лесных насаждений).</p>\n<p>Секция 11. Геоэкология (рельеф и рельефообразующие факторы, формы рельефа, обусловленные экзогенными и эндогенными силами, типы ископаемых организмов и их следов, окаменелостей, горные породы и минералы, естественная радиоактивность руд и горных пород).</p>\n<p>Секция 12. Химия (эксперимент в домашних условиях, эксперимент в полевых условиях, эксперимент в лабораторных условиях).</p>\n<p>Секция 13. Дорога &amp;#171;Маленького принца&amp;#187; (исследовательские проекты обучающихся и воспитанников дошкольных образовательных организаций).</p>\n<p>Секция 14. Первые шаги в экологии.</p>",
        "postDate": "2025-09-24T00:07:07.94",
        "deleteDate": null,
        "author": {
            "id": 470158,
            "fio": "Осадчая Светлана Станиславна",
            "nickName": "Осадчая Светлана Станиславна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [],
        "id": 1306784,
        "name": "«Интеллектуалы XXI века». Естественно-научное направление:"
    },
    {
        "description": "<p>Уважаемые коллеги, родители и обучающиеся начинаем подготовку проектов и исследований к конкурсу &amp;quot;Интеллектуалы 21 века&amp;quot;</p>\n<p>по гуманитарному направлению предусмотрена работа секций:</p>\n<p>Секция 15.1 Краеведение. Великая Отечественная война. Поиск.</p>\n<p>Секция 15.2 Краеведение. Военная история. Специальная военная операция.</p>\n<p>Секция 15.3 Краеведение. Земляки.</p>\n<p>Секция 15.4 Краеведение. Семья и родословие.</p>\n<p>Секция 15.5 Краеведение. Археология и поисковая работа.</p>\n<p>Секция 15.6 Краеведение. Геология и природное наследие.</p>\n<p>Секция 15.7 Краеведение. Культурное наследие.</p>\n<p>Секция 15.8 Краеведение. География края.</p>\n<p>Секция 15.9 Краеведение. Нематериальное наследие и этнография края.</p>\n<p>Секция 15.10 Краеведение. Топонимика.</p>\n<p>Секция 15.11 Краеведение. Наука и технология края</p>\n<p>Секция 15.12 Краеведение. Геральдика и символика края.</p>\n<p>Секция 16.1 Культурологические науки (культурология, искусствоведение).</p>\n<p>Секция 16.2 Культурологические науки (мода и дизайн одежды, дизайн интерьера).</p>\n<p>Секция 17. Науки об обществе (социология, политология, право).</p>\n<p>Секция 18. Науки об обществе (психология, педагогика, связи с общественностью и PR).</p>\n<p>Секция 19. Экономические науки (экономика, менеджмент, маркетинг).</p>\n<p>Секция 20. Филологические науки (русский язык, литературоведение).</p>\n<p>Секция 21. Филологические науки (иностранный язык).</p>\n<p>Секция 22. Филологические науки (журналистика).</p>\n<p>Секция 23. Философия.</p>\n<p>Секция 24. Исторические науки (история).</p>",
        "postDate": "2025-09-24T00:06:33.733",
        "deleteDate": null,
        "author": {
            "id": 470158,
            "fio": "Осадчая Светлана Станиславна",
            "nickName": "Осадчая Светлана Станиславна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [],
        "id": 1306785,
        "name": "«Интеллектуалы XXI века». Гуманитарное направление:"
    },
    {
        "description": "<p>Уважаемые коллеги, родители и обучающиеся начинаем подготовку проектов и исследований к конкурсу &amp;quot;Интеллектуалы 21 века&amp;quot;</p>\n<p>по инженерно-техническому направлению предусмотрена работа секций:</p>\n<p>Секция 25. Современные физико-технические системы.</p>\n<p>Секция 26. Опто-радио-электронные приборы и системы, робототехника.</p>\n<p>Секция 27. Биомедицинские технические системы и технологии.</p>\n<p>Секция 28. Машиностроение, аэрокосмонавтика, металлургия, системы вооружения; техника и технологии; нанотехнологии.</p>\n<p>Секция 29. Архитектура и строительство.</p>",
        "postDate": "2025-09-24T00:06:01.517",
        "deleteDate": null,
        "author": {
            "id": 470158,
            "fio": "Осадчая Светлана Станиславна",
            "nickName": "Осадчая Светлана Станиславна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [],
        "id": 1306786,
        "name": "«Интеллектуалы XXI века». Инженерно-техническое направление:"
    },
    {
        "description": "<p>Добрый день, уважаемые обучающиеся и родители! Информируем, что Минцифры Челябинской области совместно с АНО &amp;#171;Центр развития цифровых технологий Челябинской области&amp;#187; реализует инициативу АНО &amp;#171;Цифровая экономика&amp;#187; по проведению всероссийского образовательного проекта в сфере информационных технологий для внеклассных общешкольных мероприятий &amp;#171;День цифры&amp;#187; (далее – мероприятие).<br/>Мероприятие состоится 21 сентября 2025 года с 10:00 до 16:00 часов в &amp;#171;Городском саду имени А. С. Пушкина&amp;#187; г. Челябинска (ул. Цвиллинга, 50).<br/>Тема 2025 года: &amp;#171;Город ИТ-решений с применением технологий ИИ&amp;#187;. В мероприятии планируется участие более 1000 школьников области в возрасте от 10 до 14 лет, а также педагоги и родители.<br/>Мероприятие будет проходить в формате образовательно-развлекательной командной игры, которая включает в себя прохождение двух туров: решение технологических кейсов и интеллектуальный квиз.<br/>С современными цифровыми технологиями и актуальными ИТ- профессиями ребят познакомят ведущие ИТ-компании: &amp;#171;Интек&amp;#187;, &amp;#171;ГК Инсмарт&amp;#187;, &amp;#171;Авито&amp;#187;, &amp;#171;Ростелеком&amp;#187;, &amp;#171;1Т&amp;#187;, &amp;#171;GIGASCHOOL&amp;#187;.<br/>Для участия в мероприятии необходимо пройти регистрацию по ссылке: https://forms.yandex.ru/cloud/6898dde290fa7b49296018be/. Участие бесплатное.</p>",
        "postDate": "2025-09-16T10:51:29.07",
        "deleteDate": null,
        "author": {
            "id": 620426,
            "fio": "Петрова Елена Валерьевна",
            "nickName": "Петрова Елена Валерьевна"
        },
        "em": {
            "id": 1,
            "name": "Комитет по делам образования города Челябинска"
        },
        "recipientInfo": null,
        "attachments": [],
        "id": 1305524,
        "name": "День цифры"
    },
    {
        "description": "<p>Уважаемые обучающиеся 9 классов города и области!</p>\n<p>Челябинская кадетская школа-интернат с первоначальной лётной подготовкой приглашает абитуриентов на подготовительные курсы по общеобразовательным&amp;#160;предметам:</p>\n<p>Физика;</p>\n<p>Математика;</p>\n<p>Русский.</p>\n<p>Сроки проведения курсов:<br/>с 4 октября 2025 по 25 апреля 2026 г.<br/>Занятия будут проходить по СУББОТАМ, с 14.00 ч., по расписанию.<br/>По вопросам организации и проведения курсов звоните по телефону: 8 (351) 210-46-43<br/>с понедельника по пятницу с 9.00. до 15.30 (обед 12.00.- 13.00).</p>\n<p>&amp;#160;</p>",
        "postDate": "2025-09-15T16:35:30.603",
        "deleteDate": null,
        "author": {
            "id": 4286029,
            "fio": "Администратор Системы ",
            "nickName": "Администратор Системы"
        },
        "em": {
            "id": 431078,
            "name": "Минобр Челябинской области"
        },
        "recipientInfo": null,
        "attachments": [],
        "id": 1305424,
        "name": "Челябинская кадетская школа-интернат с первоначальной лётной подготовкой приглашает на подготовительные курсы"
    },
    {
        "description": "",
        "postDate": "2025-09-01T09:41:43.46",
        "deleteDate": null,
        "author": {
            "id": 525007,
            "fio": "Овсянникова Татьяна Владимировна",
            "nickName": "Овсянникова Татьяна Владимировна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33797570,
                "name": "расписание на вторник 02.09.2025.docx",
                "originalFileName": "расписание на вторник 02.09.2025.docx",
                "description": null
            }
        ],
        "id": 1303135,
        "name": "Расписание на 2 сентября"
    },
    {
        "description": "<p>Уважаемые коллеги! Отправляю Памятку для классных руководителей второго филиала&amp;#160;</p>",
        "postDate": "2025-08-26T10:14:46.433",
        "deleteDate": null,
        "author": {
            "id": 4141496,
            "fio": "Картавых Светлана Геннадьевна",
            "nickName": "Картавых Светлана Геннадьевна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33792473,
                "name": "Памятка для классных руководителей в филиале 2.docx",
                "originalFileName": "Памятка для классных руководителей в филиале 2.docx",
                "description": null
            }
        ],
        "id": 1302645,
        "name": "Памятка для классных руководителей во 2 филиале"
    },
    {
        "description": "<p>Уважаемые коллеги, классные руководители, родителя и обучающиеся. Прошу вас ознакомиться с информационным материалом, направленный на выработку безопасного алгоритма поведения в чрезвычайных ситуациях.&amp;#160; Спасибо.&amp;#160;&amp;#160;</p>",
        "postDate": "2025-08-25T11:53:48.747",
        "deleteDate": null,
        "author": {
            "id": 4266591,
            "fio": "Яндиева Любовь Александровна",
            "nickName": "Яндиева Любовь Александровна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33791853,
                "name": "Алгоритм действий при угрозе беспилотника (БПЛА).pdf",
                "originalFileName": "Алгоритм действий при угрозе беспилотника (БПЛА).pdf",
                "description": null
            },
            {
                "id": 33791855,
                "name": "Общие правила антитеррористической безопасности в образовательной организации.pdf",
                "originalFileName": "Общие правила антитеррористической безопасности в образовательной организации.pdf",
                "description": null
            },
            {
                "id": 33791857,
                "name": "Плакат Алгоритм действий при нападении на образовательную организацию.pdf",
                "originalFileName": "Плакат Алгоритм действий при нападении на образовательную организацию.pdf",
                "description": null
            },
            {
                "id": 33791858,
                "name": "План действий при обнаружении взрывного устройства.pdf",
                "originalFileName": "План действий при обнаружении взрывного устройства.pdf",
                "description": null
            },
            {
                "id": 33791859,
                "name": "Правила безопасного поведения в случае угрозы взрыва в образовательной организации.pdf",
                "originalFileName": "Правила безопасного поведения в случае угрозы взрыва в образовательной организации.pdf",
                "description": null
            },
            {
                "id": 33791860,
                "name": "Рекомендации при захвате в заложники на территории образовательной организации.pdf",
                "originalFileName": "Рекомендации при захвате в заложники на территории образовательной организации.pdf",
                "description": null
            }
        ],
        "id": 1302597,
        "name": "Информация профилактического характера, как вести себя при террористической угрозе!"
    },
    {
        "description": "<p>Уважаемые коллеги, классные руководители, родителя и обучающиеся. Прошу вас ознакомиться с информационным материалом, направленный на выявление потенциальных угроз вовлечения в диверсионную деятельность, а так же выработку безопасного алгоритма поведения в чрезвычайных ситуациях.&amp;#160;</p>\n<p>&amp;#160;&amp;#160;</p>",
        "postDate": "2025-06-11T18:11:12.59",
        "deleteDate": null,
        "author": {
            "id": 4266591,
            "fio": "Яндиева Любовь Александровна",
            "nickName": "Яндиева Любовь Александровна"
        },
        "em": null,
        "recipientInfo": null,
        "attachments": [
            {
                "id": 33775416,
                "name": "ссылки на материалы НИМЦ антитеррор 03.06.2025 (1).docx",
                "originalFileName": "ссылки на материалы НИМЦ антитеррор 03.06.2025 (1).docx",
                "description": null
            }
        ],
        "id": 1301906,
        "name": "Информация профилактического характера при ЧС"
    }
]
"""
